Tekla Open API Reference for Tekla Structures 2025
InputObjectTypeAttribute Constructor (Int32)
 The custom attribute [InputObjectType()] uses this to store the input object type to the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InputObjectTypeAttribute(
	int Type
)
Public Sub New (
	Type As Integer
)
Parameters
Type
Type: System.Int32
The input object type.
See Also
Reference
InputObjectTypeAttribute Class
InputObjectTypeAttribute Overload
Tekla.Structures.Plugins Namespace